# ==============================================================================
# Базовые настройки и псевдонимы (Aliases)
# ==============================================================================
# Автоматический вывод содержимого папки при переходе через cd
cd() {
  builtin cd "$@" && ls
}

# ==============================================================================
# Чистый автозапуск Fastfetch (Только в интерактивном режиме)
# ==============================================================================
if [[ $- == *i* ]]; then
  clear
  fastfetch
fi
